TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияИсходящихСообщенийRMQ/гкс_СостоянияИсходящихСообщенийRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияИсходящихСообщенийRMQ</name>
  <enumValues>
    <name>Подготовлено</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Доставлено</name>
  </enumValues>
  <enumValues>
    <name>ДоставленоИОбработано</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиПолучателем</name>
  </enumValues>
  <enumValues>
    <name>Пропущено</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаФормированияСостояния</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЗакрыто</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияВходящихСообщенийRMQ/гкс_СостоянияВходящихСообщенийRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияВходящихСообщенийRMQ</name>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>Зарегистрировано</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>Пропущено</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЗакрыто</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияИсходящихСообщенийRMQ/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда
			
#Область СлужебныеПроцедурыИФункции

Функция СостояниеПоРезультатуОбработки(РезультатОбработки) Экспорт
	
	Сотояние = Неопределено;
	МенеджерСостоянийОбработки = Перечисления.гкс_СостоянияВходящихСообщенийRMQ; 
	СостояниеОбработки = МенеджерСостоянийОбработки[РезультатОбработки];
	
	Если СостояниеОбработки = МенеджерСостоянийОбработки.ВОбработке 
		ИЛИ СостояниеОбработки = МенеджерСостоянийОбработки.Зарегистрировано Тогда
		Сотояние = Доставлено;
	ИначеЕсли СостояниеОбработки = МенеджерСостоянийОбработки.Обработано Тогда
		Сотояние = ДоставленоИОбработано;
	ИначеЕсли СостояниеОбработки = МенеджерСостоянийОбработки.ОшибкаОбработки Тогда
		Сотояние = ОшибкаОбработкиПолучателем;
	КонецЕсли;
	
	Возврат Сотояние;
		
КонецФункции
	
#КонецОбласти

#КонецЕсли
